In [1]:
%pylab inline
import pandas as pd
import seaborn as sns

Populating the interactive namespace from numpy and matplotlib

## Import CSV and store in DataFrame and inspect

In [20]:
df = pd.read_csv('uber-raw-data-apr14.csv', parse_dates=['Date/Time'])

In [21]:
df.head()

            Date/Time      Lat      Lon    Base
0 2014-04-01 00:11:00  40.7690 -73.9549  B02512
1 2014-04-01 00:17:00  40.7267 -74.0345  B02512
2 2014-04-01 00:21:00  40.7316 -73.9873  B02512
3 2014-04-01 00:28:00  40.7588 -73.9776  B02512
4 2014-04-01 00:33:00  40.7594 -73.9722  B02512

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 564516 entries, 0 to 564515
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   Date/Time  564516 non-null  datetime64[ns]
 1   Lat        564516 non-null  float64
 2   Lon        564516 non-null  float64
 3   Base       564516 non-null  object
dtypes: datetime64[ns](1), float64(2), object(1)
memory usage: 17.2+ MB

#### Describe the data

In [10]:
df.describe(include='all', datetime_is_numeric=True)

                            Date/Time            Lat            Lon    Base
count                          564516  564516.000000  564516.000000  564516
unique                            NaN            NaN            NaN       5
top                               NaN            NaN            NaN  B02682
freq                              NaN            NaN            NaN  227808
mean    2014-04-16 17:46:01.296261120      40.740005     -73.976817     NaN
min               2014-04-01 00:00:00      40.072900     -74.773300     NaN
25%               2014-04-08 16:27:00      40.722500     -73.997700     NaN
50%               2014-04-16 19:19:00      40.742500     -73.984800     NaN
75%               2014-04-24 22:14:00      40.760700     -73.970000     NaN
max               2014-04-30 23:59:00      42.116600     -72.066600     NaN
std                               NaN       0.036083       0.050426     NaN

#### We only have 5 unique bases so we can turn that into a category

In [11]:
df['Base'] = df['Base'].astype('category')

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 564516 entries, 0 to 564515
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   Date/Time  564516 non-null  datetime64[ns]
 1   Lat        564516 non-null  float64
 2   Lon        564516 non-null  float64
 3   Base       564516 non-null  category
dtypes: category(1), datetime64[ns](1), float64(2)
memory usage: 13.5 MB

#### Create day of month, weekday, and hour columns

In [26]:
df['dom'] = df['Date/Time'].dt.day
df['weekday'] = df['Date/Time'].dt.weekday
df['hour'] = df['Date/Time'].dt.hour

In [29]:
df.sample(5)

                 Date/Time      Lat      Lon    Base  dom  weekday  hour
319388 2014-04-29 20:07:00  40.7550 -73.9796  B02617   29        1    20
159773 2014-04-24 08:53:00  40.7617 -73.9749  B02598   24        3     8
2167   2014-04-02 20:31:00  40.7404 -73.9964  B02512    2        2    20
379191 2014-04-07 15:08:00  40.7104 -73.9847  B02682    7        0    15
306973 2014-04-26 03:22:00  40.7688 -73.9848  B02617   26        5     3

## Analyze the data